/*
Смоделировать сервис по починке телефонов
        Сервис должен принимать любой телефон (создать 3-4 реализации)
        Одна реализация телефона должна иметь поломку (любая реализация, просто чтобы ваш сервис мог найти эту поломку и обработать)
        Каждый класс телефона должен иметь один уникальный метод
        После нахождения поломки нужно протестировать все методы данного телефона (вызвать все метода класса)
        Выполнить двух-этапное сравнение (equals и hashCode) сломанного телефона с эталонным

        Написать программу на основе ООП принципов
*/
package selfEducation.lesson11.HomeWork;

public class Main {
}
